const moment = require('moment-timezone');

module.exports.config = {
  name: "autotime",
  version: "2.0.0",
  role: 0,
  author: "𝗔𝗺𝗶𝗻𝘂𝗹 𝗦𝗼𝗿𝗱𝗮𝗿",
description: "autotime",
  category: "AutoTime",
  countDown: 3
};

module.exports.onLoad = async ({ api }) => {
  const arrayData = {
     "12:00:00 PM": {
        message: "──── •💜• ────\n 𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 12:00 𝗔𝐌 ⏳\n\n এখন রাত ১২টা বেজে গেলো সবাই শুয়ে পড়ো 🥀\n ──── •💜• ────"
      },
      "01:00:00 AM": {
        message: "──── •💜• ────\n 𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 1:00 A𝐌 ⏳\n\n এখন রাত ১টা বাজে প্রেম না কইরা যাইয়া ঘুমা বেক্কল😘\n ──── •💜• ──── "
      },
      "02:00:00 AM": {
        message: "──── •💜• ────\n 𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 2:00 A𝐌 ⏳\n\n এখন রাত ২টা বাজে যারা ছ্যাকা খাইছে তারা জেগে আছে 😳\n ──── •💜• ──── "

      },
      "03:00:00 AM": {
        message: "──── •💜• ────\n 𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 3:00 A𝐌 ⏳\n\n এখন রাত ৩টা বাজে সবাই মনে হয় ঘুম🥹 আমার ভাই ঘুম আসে না🌃 \n──── •💜• ──── "
        
      },
      "04:00:00 AM": {
        message: "──── •💜• ────\n 𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 4:00 A𝐌 ⏳\n\n এখন রাত ৪টা বাজে একটু পর ফজরের আযান দিলে নামাজ পড়ে নিও সবাই 🌃 \n──── •💜• ──── "

      },
      "05:00:00 AM": {
        message: "──── •💜• ────\n 𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 5:00 𝗔𝐌 ⏳\n\n এখন ভোর ৫টা বাজে সবাই নামাজ পড়ছো তো?❤️ \n──── •💜• ────"
        
      },
      "06:00:00 AM": {
        message: "──── •💜• ────\n 𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 6:00 A𝐌 ⏳\n\n এখন সকাল ৬টা বাজে ঘুম থেকে উঠো সবাই❤️🥀 💖 \n──── •💜• ──── "
        
      },
      "07:00:00 AM": {
        message: "──── •💜• ────\n 𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 7:00 A𝐌 ⏳\n\n এখন সকাল ৭টা বাজে সবাই ব্রেকফাস্ট করে নাও🥰 \n──── •💜• ────"
        
      },
      "08:00:00 AM": {
        message: "──── •💜• ──── \n 𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 8:00 A𝐌 ⏳\n\n এখন সকাল ৮ টা বাজে সবাই মনে হয় কাজে ব্যস্ত হয়ে গেছো😵 \n──── •💜• ──── "
        
      },
      "09:00:00 AM": {
        message: "──── •💜• ────\n 𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 9:00 A𝐌 ⏳\n\n এখন সকাল ৯ টা বাজে মন দিয়ে কাজ করো সবাই❤️🙈 \n──── •💜• ────"
        
      },
      "10:00:00 AM": {
        message: "──── •💜• ────\n 𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 10:00 A𝐌 ⏳\n\n এখন সকাল ১০টা বাজে মিস করছি তোমাদের🙀\n──── •💜• ────"
        
      },
      "11:00:00 AM": {
        message: "──── •💜• ────\n 𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 11:00 A𝐌 ⏳\n\n এখন সকাল ১১টা বাজে😻\n ──── •💜• ────"
        
      },
      "12:00:00 PM": {
        message: "──── •💜• ────\n 𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 12:00 𝐏𝐌 ⏳\n\n এখন দুপুর ১২টা বাজে ❤️🥵\n ──── •💜• ────"
        
      },
      "01:00:00 PM": {
        message: "──── •💜• ────\n 𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 1:00 𝐏𝐌 ⏳\n\n এখন দুপুর ১টা বাজে সবাই কাজ বন্ধ করে জোহরের নামাজ পড়ে নাও😻😇 \n ──── •💜• ──── 🚶"
        
      },
      "02:00:00 PM": {
        message: "──── •💜• ────\n 𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 2:00 𝐏𝐌 ⏳\n\n এখন দুপুর ২টা বাজে গোসল করে সবাই দুপুরের খাবার খেয়ে নাও 💖😇\n ──── •💜• ──── "
        
      },
      "03:00:00 PM": {
        message: "──── •💜• ────\n 𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 3:00 𝐏𝐌 ⏳\n\n ~এখন দুপুর ৩টা বাজে😘\n ──── •💜• ────"
        
      },
      "04:00:00 PM": {
        message: "──── •💜• ────\n 𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 4:00 𝐏𝐌 ⏳\n\n এখন বিকাল ৪টা বাজে আসরের আযান দিলে সবাই নামাজ পড়ে নাও🥵\n ──── •💜• ────"
        
      },
      "05:00:00 PM": {
        message: "──── •💜• ────\n 𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 5:00 𝐏𝐌 ⏳\n\n এখন বিকাল ৫টা বাজে একটু পর মাগরিবের আযান দিবে সবাই নামাজ পড়ে নিও 😻😇\n ──── •💜• ────"
        
      },
      "06:00:00 PM": {
        message: "──── •💜• ────\n 𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 6:00 𝐏𝐌 ⏳\n\n এখন সন্ধ্যা ৬টা বাজে সবাই হাতমুখ ধুয়ে কিছু খেয়ে নাও এবং পরিবারের সাথে সময় কাটাও 💖\n ──── •💜• ────"
        
      },
      "07:00:00 PM": {
        message: "──── •💜• ────\n 𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 7:00 𝐏𝐌 ⏳\n\n এখন সন্ধ্যা ৭ টা বাজে কি করছো সবাই এখন এশার আযান দিবে সবাই নামাজ পড়ে নাও💞\n ──── •💜• ────"
        
      },
      "08:00:00 PM": {
        message: "──── •💜• ────\n 𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 8:00 𝐏𝐌 ⏳\n\n এখন রাত ৮টা বাজে 😋\n ──── •💜• ────"
        
      },
      "09:00:00 PM": {
        message: "──── •💜• ────\n 𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 9:00 𝐏𝐌 ⏳\n\n এখন রাত ৯টা বাজে সবাই কি শুয়ে পড়লা 💞\n ──── •💜• ────"
        
      },
      "10:00:00 PM": {
        message: "──── •💜• ────\n 𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 10:00 𝐏𝐌 ⏳\n\n এখন রাত ১০টা বাজে সবাই ঘুমায় পড়ো আমার বউ নাই ভাই ঘুম ও আসে না ☺️\n ──── •💜• ────"
        
      },
      "11:00:00 PM": {
        message: "──── •💜• ────\n 𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 11:00 𝐏𝐌 ⏳\n\n এখন রাত ১১টা বাজে\nখাউয়া দাউয়া করে নেউ😙\n ──── •💜• ────"
      }

    // Add more messages for other times as needed
  };

  const checkTimeAndSendMessage = () => {
    const now = moment().tz('Asia/Dhaka');
    const currentTime = now.format('hh:mm:ss A');

    const messageData = arrayData[currentTime];

    if (messageData) {
      const tid = global.db.allThreadData.map(i => i.threadID);
      tid.forEach(async (threadID, index) => {
        api.sendMessage({ body: messageData.message }, threadID);
      });
    }

    const nextMinute = moment().add(1, 'minute').startOf('minute');
    const delay = nextMinute.diff(moment());
    setTimeout(checkTimeAndSendMessage, delay);
  };

  checkTimeAndSendMessage();
};

module.exports.onStart = () => {};
